
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/haruguchi-yuma/aws-ecs-terraform/actions/runs/14417818299)



<pre><code>Apply complete! Resources: 2 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
[command]/home/runner/work/_temp/fb99f586-d88a-447a-aa84-00d0c68829fe/terraform-bin apply -auto-approve -input=false
Acquiring state lock. This may take a few moments...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-02a7999140cb7d46b]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-01a98b100a9e90a27]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-083b13fd8062f5801]
aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:710195278619:targetgroup/go-simple-server-target-group/3d6ca46497e5196e]
aws_security_group.ecs: Refreshing state... [id=sg-0cf92546af3fca408]
aws_security_group.alb: Refreshing state... [id=sg-064f56ad0151fd4c4]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-056447c0f16234a92]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0de12d0e72aff9d6a]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-00a371ec09c5c42c7]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-08c4c6f0fdf563338]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0683321158553d692]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0ebdf5ff77b8d2269]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0c79b8ce30703dd14]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0cd033fa9e54ffeb8]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-054620f453b63a8dd]
aws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-4274032936]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0e7655c2afa897b05]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-02ee760d8bf1079fa]
aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:710195278619:loadbalancer/app/go-simple-server-alb/68fbded159ad586e]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-036840bbfc61d3a71]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-084cb5bd4ae4d314c]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-07699eac2ec2333ab]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-07102b0ebd9f490c1]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-054620f453b63a8dd1080289494]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-04324b55eef143096]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0a29804183b7a0528]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0cd033fa9e54ffeb81080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0ebdf5ff77b8d22691080289494]
aws_lb_listener.aws_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:710195278619:listener/app/go-simple-server-alb/68fbded159ad586e/c74561e4509842a4]
aws_lb_listener_rule.alb_listener_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:710195278619:listener-rule/app/go-simple-server-alb/68fbded159ad586e/c74561e4509842a4/561bb86566bf54b8]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecr_lifecycle_policy.ecr_lifecycle_policy will be created
  + resource "aws_ecr_lifecycle_policy" "ecr_lifecycle_policy" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 30 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 30
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "go-simple-server"
    }

  # aws_ecr_repository.ecr_repository will be created
  + resource "aws_ecr_repository" "ecr_repository" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "go-simple-server"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
aws_ecr_repository.ecr_repository: Creating...
aws_ecr_repository.ecr_repository: Creation complete after 1s [id=go-simple-server]
aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Creating...
aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Creation complete after 0s [id=go-simple-server]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.
::debug::Terraform exited with code 0.
::debug::stdout: Acquiring state lock. This may take a few moments...%0Amodule.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-02a7999140cb7d46b]%0Amodule.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-01a98b100a9e90a27]%0Amodule.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-083b13fd8062f5801]%0Aaws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:710195278619:targetgroup/go-simple-server-target-group/3d6ca46497e5196e]%0Aaws_security_group.ecs: Refreshing state... [id=sg-0cf92546af3fca408]%0Aaws_security_group.alb: Refreshing state... [id=sg-064f56ad0151fd4c4]%0Amodule.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-056447c0f16234a92]%0Amodule.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0de12d0e72aff9d6a]%0Amodule.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-00a371ec09c5c42c7]%0Amodule.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-08c4c6f0fdf563338]%0Amodule.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0683321158553d692]%0Amodule.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0ebdf5ff77b8d2269]%0Amodule.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0c79b8ce30703dd14]%0Amodule.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0cd033fa9e54ffeb8]%0Amodule.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-054620f453b63a8dd]%0Aaws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-4274032936]%0Amodule.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0e7655c2afa897b05]%0Amodule.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-02ee760d8bf1079fa]%0Aaws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:710195278619:loadbalancer/app/go-simple-server-alb/68fbded159ad586e]%0Amodule.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-036840bbfc61d3a71]%0Amodule.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-084cb5bd4ae4d314c]%0Amodule.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-07699eac2ec2333ab]%0Amodule.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-07102b0ebd9f490c1]%0Amodule.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-054620f453b63a8dd1080289494]%0Amodule.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-04324b55eef143096]%0Amodule.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0a29804183b7a0528]%0Amodule.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0cd033fa9e54ffeb81080289494]%0Amodule.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0ebdf5ff77b8d22691080289494]%0Aaws_lb_listener.aws_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:710195278619:listener/app/go-simple-server-alb/68fbded159ad586e/c74561e4509842a4]%0Aaws_lb_listener_rule.alb_listener_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:710195278619:listener-rule/app/go-simple-server-alb/68fbded159ad586e/c74561e4509842a4/561bb86566bf54b8]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_ecr_lifecycle_policy.ecr_lifecycle_policy will be created%0A  + resource "aws_ecr_lifecycle_policy" "ecr_lifecycle_policy" {%0A      + id          = (known after apply)%0A      + policy      = jsonencode(%0A            {%0A              + rules = [%0A                  + {%0A                      + action       = {%0A                          + type = "expire"%0A                        }%0A                      + description  = "Keep last 30 images"%0A                      + rulePriority = 1%0A                      + selection    = {%0A                          + countNumber = 30%0A                          + countType   = "imageCountMoreThan"%0A                          + tagStatus   = "any"%0A                        }%0A                    },%0A                ]%0A            }%0A        )%0A      + registry_id = (known after apply)%0A      + repository  = "go-simple-server"%0A    }%0A%0A  # aws_ecr_repository.ecr_repository will be created%0A  + resource "aws_ecr_repository" "ecr_repository" {%0A      + arn                  = (known after apply)%0A      + force_delete         = true%0A      + id                   = (known after apply)%0A      + image_tag_mutability = "IMMUTABLE"%0A      + name                 = "go-simple-server"%0A      + registry_id          = (known after apply)%0A      + repository_url       = (known after apply)%0A      + tags_all             = (known after apply)%0A%0A      + image_scanning_configuration {%0A          + scan_on_push = true%0A        }%0A    }%0A%0APlan: 2 to add, 0 to change, 0 to destroy.%0Aaws_ecr_repository.ecr_repository: Creating...%0Aaws_ecr_repository.ecr_repository: Creation complete after 1s [id=go-simple-server]%0Aaws_ecr_lifecycle_policy.ecr_lifecycle_policy: Creating...%0Aaws_ecr_lifecycle_policy.ecr_lifecycle_policy: Creation complete after 0s [id=go-simple-server]%0AReleasing state lock. This may take a few moments...%0A%0AApply complete! Resources: 2 added, 0 changed, 0 destroyed.%0A
::debug::stderr: 
::debug::exitcode: 0

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":5,"Program":"tfcmt","SHA1":"3bf61868713a5bcc5db125fa5d00f1e8ebe44ebd","Vars":{},"WorkflowName":"Terraform"} -->